Revit 2027 API
BuiltInFailures.StairRampFailures.StairsComponentJoinFailure Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsComponentJoinFailure { get; }
Public Shared ReadOnly Property StairsComponentJoinFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsComponentJoinFailure {
	FailureDefinitionId^ get ();
}
static member StairsComponentJoinFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace